results/final/nginx-scx-compare-20260708-152602/run-3/noisy_scx_normal_wrk.txt
Running 10s test @ http://127.0.0.1:18082/
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.76ms    1.10ms  18.12ms   77.12%
    Req/Sec     8.59k     1.14k   10.66k    62.50%
  Latency Distribution
     50%    1.75ms
     75%    2.43ms
     90%    3.02ms
     99%    4.21ms
  171950 requests in 10.07s, 30.01MB read
Requests/sec:  17077.46
Transfer/sec:      2.98MB